simulation_templates/0.original/qwall.fixedflux
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      qwall;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"

dimensions      [ 0 1 -1 1 0 0 0 ];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    lower
    {
        type            fixedValue;
        value           uniform $qwall;
    } 
    upper
    {
        type            fixedValue;
        value           $internalField;
    }
    west 
    {
        type            cyclic;
        value           $internalField;
    }
    east 
    {
        type            cyclic;
        value           $internalField;
    }
    north 
    {
        type            cyclic;
        value           $internalField;
    }
    south
    {
        type            cyclic;
        value           $internalField;
    }
}


// ************************************************************************* //
