simulation_templates/system/sampling/boundaryDataPre
      boundaryDataPre
      {
          type                 surfaces;
          functionObjectLibs   ("libsampling.so");
          enabled              true;
          interpolationScheme  isThisNeeded;
          outputControl        timeStep;
          outputInterval       1;
          surfaceFormat        foamFile;
          fields
          (
              U
              T
              k
          );
          surfaces
          (
              south
              {
                  type         patch;
                  patches      (south);
                  triangulate  false;
              }
          );
      }
